const guaDatabase = {
  "乾": {
    "上卦": "乾",
    "下卦": "乾"
  },
  "坤": {
    "上卦": "坤",
    "下卦": "坤"
  },
  "屯": {
    "上卦": "坎",
    "下卦": "震"
  },
  "蒙": {
    "上卦": "艮",
    "下卦": "坎"
  },
  "需": {
    "上卦": "坎",
    "下卦": "乾"
  },
  "讼": {
    "上卦": "乾",
    "下卦": "坎"
  },
  "师": {
    "上卦": "坤",
    "下卦": "坎"
  },
  "比": {
    "上卦": "坎",
    "下卦": "坤"
  },
  "小畜": {
    "上卦": "巽",
    "下卦": "乾"
  },
  "履": {
    "上卦": "乾",
    "下卦": "兑"
  },
  "泰": {
    "上卦": "坤",
    "下卦": "乾"
  },
  "否": {
    "上卦": "乾",
    "下卦": "坤"
  },
  "同人": {
    "上卦": "乾",
    "下卦": "离"
  },
  "大有": {
    "上卦": "离",
    "下卦": "乾"
  },
  "谦": {
    "上卦": "坤",
    "下卦": "艮"
  },
  "豫": {
    "上卦": "震",
    "下卦": "坤"
  },
  "随": {
    "上卦": "兑",
    "下卦": "震"
  },
  "蛊": {
    "上卦": "艮",
    "下卦": "巽"
  },
  "临": {
    "上卦": "坤",
    "下卦": "兑"
  },
  "观": {
    "上卦": "巽",
    "下卦": "坤"
  },
  "噬嗑": {
    "上卦": "离",
    "下卦": "震"
  },
  "贲": {
    "上卦": "艮",
    "下卦": "离"
  },
  "剥": {
    "上卦": "艮",
    "下卦": "坤"
  },
  "复": {
    "上卦": "坤",
    "下卦": "震"
  },
  "无妄": {
    "上卦": "乾",
    "下卦": "震"
  },
  "大畜": {
    "上卦": "艮",
    "下卦": "乾"
  },
  "颐": {
    "上卦": "艮",
    "下卦": "震"
  },
  "大过": {
    "上卦": "兑",
    "下卦": "巽"
  },
  "坎": {
    "上卦": "坎",
    "下卦": "坎"
  },
  "离": {
    "上卦": "离",
    "下卦": "离"
  },
  "咸": {
    "上卦": "兑",
    "下卦": "艮"
  },
  "恒": {
    "上卦": "震",
    "下卦": "巽"
  },
  "遁": {
    "上卦": "乾",
    "下卦": "艮"
  },
  "大壮": {
    "上卦": "震",
    "下卦": "乾"
  },
  "晋": {
    "上卦": "离",
    "下卦": "坤"
  },
  "明夷": {
    "上卦": "坤",
    "下卦": "离"
  },
  "家人": {
    "上卦": "巽",
    "下卦": "离"
  },
  "睽": {
    "上卦": "离",
    "下卦": "兑"
  },
  "蹇": {
    "上卦": "坎",
    "下卦": "艮"
  },
  "解": {
    "上卦": "震",
    "下卦": "坎"
  },
  "损": {
    "上卦": "艮",
    "下卦": "兑"
  },
  "益": {
    "上卦": "巽",
    "下卦": "震"
  },
  "夬": {
    "上卦": "兑",
    "下卦": "乾"
  },
  "姤": {
    "上卦": "乾",
    "下卦": "巽"
  },
  "萃": {
    "上卦": "兑",
    "下卦": "坤"
  },
  "升": {
    "上卦": "坤",
    "下卦": "巽"
  },
  "困": {
    "上卦": "兑",
    "下卦": "坎"
  },
  "井": {
    "上卦": "坎",
    "下卦": "巽"
  },
  "革": {
    "上卦": "兑",
    "下卦": "离"
  },
  "鼎": {
    "上卦": "离",
    "下卦": "巽"
  },
  "震": {
    "上卦": "震",
    "下卦": "震"
  },
  "艮": {
    "上卦": "艮",
    "下卦": "艮"
  },
  "渐": {
    "上卦": "巽",
    "下卦": "艮"
  },
  "归妹": {
    "上卦": "震",
    "下卦": "兑"
  },
  "丰": {
    "上卦": "震",
    "下卦": "离"
  },
  "旅": {
    "上卦": "离",
    "下卦": "艮"
  },
  "巽": {
    "上卦": "巽",
    "下卦": "巽"
  },
  "兑": {
    "上卦": "兑",
    "下卦": "兑"
  },
  "涣": {
    "上卦": "巽",
    "下卦": "坎"
  },
  "节": {
    "上卦": "坎",
    "下卦": "兑"
  },
  "中孚": {
    "上卦": "巽",
    "下卦": "兑"
  },
  "小过": {
    "上卦": "震",
    "下卦": "艮"
  },
  "既济": {
    "上卦": "坎",
    "下卦": "离"
  },
  "未济": {
    "上卦": "离",
    "下卦": "坎"
  }
};
